## Plan Result (prod-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"
        name                = "aks00-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/bulk-scan-processor"
          ~ name         = "bulk-scan-processor" -> "am-judicial-booking-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/bulk-scan-orchestrator"
          ~ name         = "bulk-scan-orchestrator" -> "bulk-scan-processor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/bulk-scan-payment-processor"
          ~ name         = "bulk-scan-payment-processor" -> "bulk-scan-orchestrator"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/reform-scan-blob-router"
          ~ name         = "reform-scan-blob-router" -> "bulk-scan-payment-processor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/reform-scan-notification-service"
          ~ name         = "reform-scan-notification-service" -> "reform-scan-blob-router"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rpe-send-letter-service"
          ~ name         = "rpe-send-letter-service" -> "reform-scan-notification-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccpay-bulkscanning-api"
          ~ name         = "ccpay-bulkscanning-api" -> "rpe-send-letter-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-terms-and-conditions"
          ~ name         = "xui-terms-and-conditions" -> "ccpay-bulkscanning-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-activity-tracker-api"
          ~ name         = "xui-activity-tracker-api" -> "xui-terms-and-conditions"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/cmc-claim-store"
          ~ name         = "cmc-claim-store" -> "xui-activity-tracker-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/idam-api"
          ~ name         = "idam-api" -> "cmc-claim-store"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/idam-web-admin"
          ~ name         = "idam-web-admin" -> "idam-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/idam-user-dashboard"
          ~ name         = "idam-user-dashboard" -> "idam-web-admin"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/fact-api"
          ~ name         = "fact-api" -> "idam-user-dashboard"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/dg-docmosis"
          ~ name         = "dg-docmosis" -> "fact-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-workflow-api"
          ~ name         = "wa-workflow-api" -> "dg-docmosis"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-management-api"
          ~ name         = "wa-task-management-api" -> "wa-workflow-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-case-event-handler"
          ~ name         = "wa-case-event-handler" -> "wa-task-management-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-monitor"
          ~ name         = "wa-task-monitor" -> "wa-case-event-handler"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/civil-service"
          ~ name         = "civil-service" -> "wa-task-monitor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/nfdiv-case-api"
          ~ name         = "nfdiv-case-api" -> "civil-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/adoption-cos-api"
          ~ name         = "adoption-cos-api" -> "nfdiv-case-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/prl-cos"
          ~ name         = "prl-cos" -> "adoption-cos-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/prl-dgs"
          ~ name         = "prl-dgs" -> "prl-cos"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/hmc-cft-hearing-service"
          ~ name         = "hmc-cft-hearing-service" -> "prl-dgs"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/hmc-hmi-inbound-adapter"
          ~ name         = "hmc-hmi-inbound-adapter" -> "hmc-cft-hearing-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/hmc-hmi-outbound-adapter"
          ~ name         = "hmc-hmi-outbound-adapter" -> "hmc-hmi-inbound-adapter"
            # (2 unchanged attributes hidden)
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "hmc-hmi-outbound-adapter"
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-processor"
          ~ name                                = "bulk-scan-processor" -> "am-judicial-booking-service"
          ~ probe_name                          = "bulk-scan-processor" -> "am-judicial-booking-service"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-orchestrator"
          ~ name                                = "bulk-scan-orchestrator" -> "bulk-scan-processor"
          ~ probe_name                          = "bulk-scan-orchestrator" -> "bulk-scan-processor"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-payment-processor"
          ~ name                                = "bulk-scan-payment-processor" -> "bulk-scan-orchestrator"
          ~ probe_name                          = "bulk-scan-payment-processor" -> "bulk-scan-orchestrator"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/reform-scan-blob-router"
          ~ name                                = "reform-scan-blob-router" -> "bulk-scan-payment-processor"
          ~ probe_name                          = "reform-scan-blob-router" -> "bulk-scan-payment-processor"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/reform-scan-notification-service"
          ~ name                                = "reform-scan-notification-service" -> "reform-scan-blob-router"
          ~ probe_name                          = "reform-scan-notification-service" -> "reform-scan-blob-router"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/rpe-send-letter-service"
          ~ name                                = "rpe-send-letter-service" -> "reform-scan-notification-service"
          ~ probe_name                          = "rpe-send-letter-service" -> "reform-scan-notification-service"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/ccpay-bulkscanning-api"
          ~ name                                = "ccpay-bulkscanning-api" -> "rpe-send-letter-service"
          ~ probe_name                          = "ccpay-bulkscanning-api" -> "rpe-send-letter-service"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-terms-and-conditions"
          ~ name                                = "xui-terms-and-conditions" -> "ccpay-bulkscanning-api"
          ~ probe_name                          = "xui-terms-and-conditions" -> "ccpay-bulkscanning-api"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-activity-tracker-api"
          ~ name                                = "xui-activity-tracker-api" -> "xui-terms-and-conditions"
          ~ probe_name                          = "xui-activity-tracker-api" -> "xui-terms-and-conditions"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/cmc-claim-store"
          ~ name                                = "cmc-claim-store" -> "xui-activity-tracker-api"
          ~ probe_name                          = "cmc-claim-store" -> "xui-activity-tracker-api"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/idam-api"
          ~ name                                = "idam-api" -> "cmc-claim-store"
          ~ probe_name                          = "idam-api" -> "cmc-claim-store"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
          ~ cookie_based_affinity               = "Enabled" -> "Disabled"
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/idam-web-admin"
          ~ name                                = "idam-web-admin" -> "idam-api"
          ~ probe_name                          = "idam-web-admin" -> "idam-api"
            # (6 unchanged attributes hidden)
        }
      ~ backend_http_settings {
          ~ cookie_based_affinity               = "Disabled" -> "Enabled"
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/idam-user-dashboard"
          ~ name                                = "idam-user-dashboard" -> "idam-web-admin"
          ~ probe_name                          = "idam-user-dashboard" -> "idam-web-admin"
            # (6 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/fact-api"
          ~ name                                = "fact-api" -> "idam-user-dashboard"
          ~ probe_name                          = "fact-api" -> "idam-user-dashboard"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
          ~ cookie_based_affinity               = "Enabled" -> "Disabled"
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/dg-docmosis"
          ~ name                                = "dg-docmosis" -> "fact-api"
          ~ probe_name                          = "dg-docmosis" -> "fact-api"
            # (6 unchanged attributes hidden)
        }
      ~ backend_http_settings {
          ~ cookie_based_affinity               = "Disabled" -> "Enabled"
            i

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-case-event-handler" -> null
          - backend_address_pool_name  = "wa-case-event-handler" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-case-event-handler" -> null
          - backend_http_settings_name = "wa-case-event-handler" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-case-event-handler" -> null
          - http_listener_name         = "wa-case-event-handler" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-case-event-handler" -> null
          - name                       = "wa-case-event-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-case-event-handler"
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-case-event-handler"
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-case-event-handler"
          + http_listener_name         = "wa-case-event-handler"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-case-event-handler"
          + name                       = "wa-case-event-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-management-api" -> null
          - backend_address_pool_name  = "wa-task-management-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-management-api" -> null
          - backend_http_settings_name = "wa-task-management-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-management-api" -> null
          - http_listener_name         = "wa-task-management-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-management-api" -> null
          - name                       = "wa-task-management-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-management-api"
          + backend_address_pool_name  = "wa-task-management-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-management-api"
          + backend_http_settings_name = "wa-task-management-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-management-api"
          + http_listener_name         = "wa-task-management-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-management-api"
          + name                       = "wa-task-management-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-monitor" -> null
          - backend_address_pool_name  = "wa-task-monitor" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-monitor" -> null
          - backend_http_settings_name = "wa-task-monitor" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-monitor" -> null
          - http_listener_name         = "wa-task-monitor" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-monitor" -> null
          - name                       = "wa-task-monitor" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-monitor"
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-monitor"
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-monitor"
          + http_listener_name         = "wa-task-monitor"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-monitor"
          + name                       = "wa-task-monitor"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-workflow-api" -> null
          - backend_address_pool_name  = "wa-workflow-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-workflow-api" -> null
          - backend_http_settings_name = "wa-workflow-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-workflow-api" -> null
          - http_listener_name         = "wa-workflow-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-workflow-api" -> null
          - name                       = "wa-workflow-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-workflow-api"
          + backend_address_pool_name  = "wa-workflow-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-workflow-api"
          + backend_http_settings_name = "wa-workflow-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-workflow-api"
          + http_listener_name         = "wa-workflow-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-workflow-api"
          + name                       = "wa-workflow-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-activity-tracker-api" -> null
          - backend_address_pool_name  = "xui-activity-tracker-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-activity-tracker-api" -> null
          - backend_http_settings_name = "xui-activity-tracker-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-activity-tracker-api" -> null
          - http_listener_name         = "xui-activity-tracker-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-activity-tracker-api" -> null
          - name                       = "xui-activity-tracker-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-activity-tracker-api"
          + backend_address_pool_name  = "xui-activity-tracker-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-activity-tracker-api"
          + backend_http_settings_name = "xui-activity-tracker-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-activity-tracker-api"
          + http_listener_name         = "xui-activity-tracker-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-activity-tracker-api"
          + name                       = "xui-activity-tracker-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-terms-and-conditions" -> null
          - backend_address_pool_name  = "xui-terms-and-conditions" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-terms-and-conditions" -> null
          - backend_http_settings_name = "xui-terms-and-conditions" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-terms-and-conditions" -> null
          - http_listener_name         = "xui-terms-and-conditions" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-terms-and-conditions" -> null
          - name                       = "xui-terms-and-conditions" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-terms-and-conditions"
          + backend_address_pool_name  = "xui-terms-and-conditions"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-terms-and-conditions"
          + backend_http_settings_name = "xui-terms-and-conditions"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-terms-and-conditions"
          + http_listener_name         = "xui-terms-and-conditions"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-terms-and-conditions"
          + name                       = "xui-terms-and-conditions"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = (known after apply)
          + name                       = "am-judicial-booking-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (303 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1261,"Program":"tfcmt","SHA1":"","Target":"prod-cftapps_cluster_lb_backend","Vars":{}} -->